Amiya200/stm32_water_tank/Core/Src/screen.c
void Screen_Init(void)
{
    lcd_init();
    lcd_clear();
    ui = UI_WELCOME;
    last_ui = UI_NONE;
    screenNeedsRefresh = true;
    lastUserAction = HAL_GetTick();
}
static inline void refreshInactivityTimer(void)
{
    lastUserAction = HAL_GetTick();
}
static inline void lcd_line(uint8_t row, const char* s)
{
    char buf[17];
    snprintf(buf, sizeof(buf), "%-16.16s", s);
    lcd_put_cur(row, 0);
    lcd_send_string(buf);
}
static uint8_t dash_page = 0;
static uint32_t dash_cycle_start = 0;
#define DASH_PAGE1_TIME 200000
#define DASH_PAGE2_TIME 500
#define DASH_PAGE3_TIME 500
static inline void lcd_line0(const char* s){ lcd_line(0,s); }
static inline void lcd_line1(const char* s){ lcd_line(1,s); }
static void show_welcome(void)
{
    lcd_clear();
    lcd_line0("   HELONIX");
    lcd_line1(" IntelligentSys");
}
static void show_dash(void)
{
    char l0[17], l1[17];
    uint32_t now = HAL_GetTick();

    if (dash_cycle_start == 0)
        dash_cycle_start = now;

    uint32_t elapsed = now - dash_cycle_start;

    if (elapsed < DASH_PAGE1_TIME)
        dash_page = 0;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME))
        dash_page = 1;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME + DASH_PAGE3_TIME))
        dash_page = 2;
    else
    {
        dash_cycle_start = now;
        dash_page = 0;
    }

    uint8_t tankPercent = ModelHandle_GetTankLevelPercent();
    bool tankFull = ModelHandle_IsTankFull();
    bool motorOn  = Motor_GetStatus();
    DryFSMState dryState = ModelHandle_GetDryState();

    const char* mode;
    if (ModelHandle_IsRestartActive())
        mode = "Refill";
    else if (ModelHandle_IsVoltageFault())
        mode = "VOLTERR";
    else if (ModelHandle_IsOverload())
        mode = "OVERLD ";
    else if (ModelHandle_IsUnderload())
        mode = "UNDERLD";
    else if (timerActive)
        mode = "TIMER  ";
    else if (autoActive)
        mode = motorOn ? "AUTO   " : "AUTO WT";
    else if (countdownActive)
        mode = motorOn ? "COUNT  " : "CD WAIT";
    else if (twistActive)
        mode = motorOn ? "TWIST  " : "TWIST W";
    else if (semiAutoActive)
        mode = "SEMI   ";
    else if (manualActive)
        mode = "MANUAL ";
    else if (tankFull)
        mode = "FULL   ";
    else
        mode = "READY  ";

    if (dash_page == 0)
    {
        snprintf(l0, sizeof(l0), "%-7sM:%s %3d%%",
                 mode, motorOn ? "ON" : "OFF", tankPercent);
        if (dryState == DRY_FAULT)
        {
            snprintf(l1, sizeof(l1), "DRY RUN FAULT");
        }
        else if (tankFull)
        {
            snprintf(l1, sizeof(l1), "TANK FULL STOP");
        }
        else
        {
            const char *gw  = (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";
            const char *dry = (adcData.voltages[5] <= 0.01f) ? "NO"  : "YES";
            snprintf(l1, sizeof(l1), "G.W:%s DRY:%s", gw, dry);
        }
    }
    else if (dash_page == 1)
    {
        snprintf(l0, sizeof(l0), "Date:%02u-%02u-%02u",
                 time.dom, time.month, (uint8_t)(time.year % 100));
        snprintf(l1, sizeof(l1), "Time:%02u:%02u:%02u",
                 time.hour, time.min, time.sec);
    }
    else
    {
        snprintf(l0, sizeof(l0), "V:%3.0fV  I:%3.1fA", g_voltageV, g_currentA);
        if (ModelHandle_IsOverload())
            snprintf(l1, sizeof(l1), "OVER LOAD!");
        else if (ModelHandle_IsUnderload())
            snprintf(l1, sizeof(l1), "UNDER LOAD!");
        else if (ModelHandle_IsVoltageFault())
            snprintf(l1, sizeof(l1), "VOLT ERROR!");
        else
            snprintf(l1, sizeof(l1), "Live Monitor");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}

static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1)
    {
        lcd_put_cur(row, 0);
        lcd_send_data('>');
    }
}
static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;
    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
    draw_menu_cursor();
}

/* ================================================================
   FIX: show_devset_menu updated to match new menu indices.
   Index 0 shows dry run enable/disable status with * when enabled.
================================================================ */
static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;

    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;

    /* Build star indicators for configured items */
    char star0 = ' ', star1 = ' ';

    for (int pass = 0; pass < 2; pass++)
    {
        uint8_t idx  = (pass == 0) ? idx0 : idx1;
        char   *star = (pass == 0) ? &star0 : &star1;
        switch (idx)
        {
            case 0:  if (edit_settings_dry_en)           *star = '*'; break;
            case 1:  if (edit_settings_gap_s > 0)        *star = '*'; break;
            case 2:  if (edit_settings_retry > 0)        *star = '*'; break;
            case 3:  if (edit_settings_uv > 0)           *star = '*'; break;
            case 4:  if (edit_settings_ov > 0)           *star = '*'; break;
            case 5:  if (edit_settings_ol > 0)           *star = '*'; break;
            case 6:  if (edit_settings_ul > 0)           *star = '*'; break;
            case 7:  if (edit_settings_maxrun > 0)       *star = '*'; break;
            default: break;
        }
    }

    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s",
                 (devset_idx == idx0 ? '>' : ' '), star0, devset_menu_items[idx0]);
    else
        snprintf(l0, sizeof(l0), "                ");

    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s",
                 (devset_idx == idx1 ? '>' : ' '), star1, devset_menu_items[idx1]);
    else
        snprintf(l1, sizeof(l1), "                ");

