Amiya200/stm32_water_tank/Core/Src/screen.c
    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_timer_slot_select(void)
{
    lcd_clear();
    int item1 = timer_page * 2;
    int item2 = item1 + 1;
    char l0[17], l1[17];
    if (item1 == 5)
        snprintf(l0, sizeof(l0), "%c Back", (currentSlot == 5 ? '>' : ' '));
    else
        snprintf(l0, sizeof(l0), "%c Timer %d", (currentSlot == item1 ? '>' : ' '), item1+1);
    if (item2 <= 5)
    {
        if (item2 == 5)
            snprintf(l1, sizeof(l1), "%c Back", (currentSlot == 5 ? '>' : ' '));
        else
            snprintf(l1, sizeof(l1), "%c Timer %d", (currentSlot == item2 ? '>' : ' '), item2+1);
    }
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_edit_on_time(void)  {}
static void show_edit_off_time(void) {}
static const char* dayNames[] = {
    "Enable All", "Disable All",
    "Mon","Tue","Wed","Thu","Fri","Sat","Sun","Next>"
};
static void show_timer_days(void)
{
    lcd_line0("Timer Days");
    char buf[17];
    if (edit_day_index >= 2 && edit_day_index <= 8)
    {
        uint8_t d = edit_day_index - 2;
        uint8_t isOn = (edit_day_mask >> d) & 1;
        snprintf(buf, sizeof(buf), "> %s (%s)", dayNames[edit_day_index], isOn?"ON":"OFF");
    }
    else
        snprintf(buf, sizeof(buf), "> %s", dayNames[edit_day_index]);
    lcd_line1(buf);
}
static void show_timer_gap(void)
{
    lcd_line0("Timer Gap (min)");
    char buf[17];
    snprintf(buf, sizeof(buf), ">T%u %3u min Next>",
             (unsigned)(currentSlot+1), (unsigned)edit_gap_min);
    lcd_line1(buf);
}
static void show_timer_enable(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Enable?", (unsigned)(currentSlot+1));
    lcd_line0(title);
    lcd_line1(edit_slot_enabled ? "YES       Next>" : "NO        Next>");
}
static void show_timer_summary(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Summary", (unsigned)(currentSlot+1));
    lcd_line0(title);
    lcd_line1(edit_slot_enabled ? "Enabled     Next>" : "Disabled    Next>");
}
static void show_auto_menu(void)
{
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}
static void show_auto_gap(void)
{
    lcd_line0("DRY GAP (s)");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_auto_gap_s);
    lcd_line1(buf);
}
static void show_auto_maxrun(void)
{
    lcd_line0("MAX RUN (min)");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_auto_maxrun_min);
    lcd_line1(buf);
}
static void show_auto_retry(void)
{
    lcd_line0("RETRY COUNT");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_auto_retry);
    lcd_line1(buf);
}
static void show_semi_auto(void)
{
    lcd_line0("Semi-Auto");
    lcd_line1(semiAutoActive ? "val:Disable Next>" : "val:Enable  Next>");
}

void ModelHandle_1SecondTask(void)
{
    if (countdownActive && countdownDuration > 0)
    {
        countdownDuration--;
        if (countdownDuration == 0)
            countdownActive = false;
    }
}

static void show_twist(void)
{
    char l0[17];
    snprintf(l0, sizeof(l0), "Tw %02us/%02us",
             (unsigned)twistSettings.onDurationSeconds,
             (unsigned)twistSettings.offDurationSeconds);
    lcd_line0(l0);
    lcd_line1(twistActive ? "val:STOP   Next>" : "val:START  Next>");
}
static void show_twist_on_sec(void)
{
    lcd_line0("TWIST ON SEC");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_on_s);
    lcd_line1(buf);
}
static void show_twist_off_sec(void)
{
    lcd_line0("TWIST OFF SEC");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_off_s);
    lcd_line1(buf);
}
static void show_twist_on_h(void)
{
    lcd_line0("TWIST ON HH");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_on_hh);
    lcd_line1(buf);
}
static void show_twist_on_m(void)
{
    lcd_line0("TWIST ON MM");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_on_mm);
    lcd_line1(buf);
}
static void show_twist_off_h(void)
{
    lcd_line0("TWIST OFF HH");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_off_hh);
    lcd_line1(buf);
}
static void show_twist_off_m(void)
{
    lcd_line0("TWIST OFF MM");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_twist_off_mm);
    lcd_line1(buf);
}
static void show_countdown(void)
{
    char l0[17], l1[17];
    if (!countdownActive)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }
    uint32_t sec = countdownDuration;
    uint32_t min = sec / 60;
    uint32_t s   = sec % 60;
    snprintf(l0, sizeof(l0), "CD %02lu:%02lu RUN",
             (unsigned long)min, (unsigned long)s);
    snprintf(l1, sizeof(l1), "DOWN=STOP");
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_countdown_edit_min(void)
{
    lcd_line0("SET MINUTES");
    char buf[17]; snprintf(buf, sizeof(buf), "val:%03u Next>", edit_countdown_min);
    lcd_line1(buf);
}

/* ================================================================
   FIX: show_settings_gap renamed to show_settings_dry_en.
   Index 0 in devset now shows dry run enable/disable toggle.
   Index 1 shows test time (gap_time_s in minutes).
   Index 2 shows retry gap (dry_run_time_s in minutes).
================================================================ */
static void show_settings_dry_en(void)
{
    lcd_line0("Dry Run Protect");
    lcd_line1(edit_settings_dry_en ? "ENABLED    Next>" : "DISABLED   Next>");
}
static void show_settings_gap(void)
{
    lcd_line0("Test Time (min)");
    char buf[17];
    if (edit_settings_gap_s == 0)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%2umin Next>", edit_settings_gap_s);
    lcd_line1(buf);
}
static void show_settings_retry(void)
{
    lcd_line0("Retry Gap (min)");
    char buf[17];
    if (edit_settings_retry == 0)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3umin Next>", edit_settings_retry);
    lcd_line1(buf);
}
static void show_settings_uv(void)
{
    lcd_line0("Low Volt");
    char buf[17];
    if (edit_settings_uv == 0)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3uV Next>", edit_settings_uv);
    lcd_line1(buf);
}
static void show_settings_ov(void)
{
    lcd_line0("High Volt");
    char buf[17];
    if (edit_settings_ov == 0)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3uV Next>", edit_settings_ov);
    lcd_line1(buf);
}
static void show_settings_ol(void)
{
    lcd_line0("Over Load (A)");
    char buf[17];
    if (edit_settings_ol < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ol);
    lcd_line1(buf);
}
static void show_settings_ul(void)
{
    lcd_line0("Under Load (A)");
    char buf[17];
    if (edit_settings_ul < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ul);
    lcd_line1(buf);
}
static void show_settings_maxrun(void)
{
    lcd_line0("Max Run");
    char buf[17];
    if (edit_settings_maxrun == 0)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3umin Next>", edit_settings_maxrun);
    lcd_line1(buf);
}
static void show_settings_pwrrest(void)
{
    lcd_line0("Power Restore");
    const char* text =
        (edit_settings_pwrrest == 0) ? "YES       Next>" :
        (edit_settings_pwrrest == 1) ? "NO        Next>" :
                                       "LAST      Next>";
    lcd_line1(text);
}
static void show_settings_factory(void)
{
    lcd_line0("Factory Reset?");
    lcd_line1(edit_settings_factory_yes ? "YES       Next>" : "NO        Next>");
}
static void show_devset_edit_date(void)
{
    lcd_line0("Set Date");
    uint8_t yy2 = (uint8_t)(edit_date_yyyy % 100);
    char buf[17];
    if      (edit_date_field == 0) snprintf(buf, sizeof(buf), "[%02u]-%02u-%02u", edit_date_dd, edit_date_mm, yy2);
    else if (edit_date_field == 1) snprintf(buf, sizeof(buf), "%02u-[%02u]-%02u", edit_date_dd, edit_date_mm, yy2);
    else                           snprintf(buf, sizeof(buf), "%02u-%02u-[%02u]", edit_date_dd, edit_date_mm, yy2);
    lcd_line1(buf);
}
static void show_devset_edit_time(void)
{
    lcd_line0("Set Time");
    char buf[17];
    if (edit_time_field == 0)
        snprintf(buf, sizeof(buf), "[%02u]:%02u", edit_time_hh, edit_time_min);
    else
        snprintf(buf, sizeof(buf), "%02u:[%02u]", edit_time_hh, edit_time_min);
    lcd_line1(buf);
}
static void show_devset_edit_day(void)
{
    lcd_line0("Set Day");
    char buf[17];
    snprintf(buf, sizeof(buf), "> %s", dowNames[edit_day_idx2 % 7]);
    lcd_line1(buf);
}
static void show_add_device_menu(void)
{
    lcd_line0(addDevMenuIndex == 0 ? ">Pair Device"   : " Pair Device");
    lcd_line1(addDevMenuIndex == 1 ? ">Remove Device" : " Remove Device");
}
static void show_add_device_pair(void)
{
    lcd_line0("Pair Device");
    char buf[17];
    snprintf(buf, sizeof(buf), ">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}
static void show_add_device_remove(void)
{
    lcd_line0("Remove Device");
    char buf[17];
    snprintf(buf, sizeof(buf), ">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}
static void show_add_device_pair_done(void)
{
    lcd_line0("Paired Device");
    char buf[17];
    snprintf(buf, sizeof(buf), "%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}
static void show_add_device_remove_done(void)
{
    lcd_line0("Removed Device");
    char buf[17];
    snprintf(buf, sizeof(buf), "%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}
static void show_reset_confirm(void)
{
    lcd_line0("Reset To Default?");
    lcd_line1(reset_confirm_yes ? "YES       Apply>" : "NO        Back>");
}

/* ================================================================
   FIX: apply_settings_core now correctly applies:
     1. gap_time_s  from edit_settings_gap_s  (minutes → seconds)
     2. dry_run_time_s from edit_settings_retry (minutes → seconds)
     3. dry_run_enable from edit_settings_dry_en

