Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui >= UI_MAX_)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Cursor is always visible – no blink, no unnecessary LCD refresh */
    (void)lastBlink;

    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime) >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (screenNeedsRefresh || ui != last_ui)
    {
        if (ui != last_ui) { lcd_clear(); last_ui = ui; }
        screenNeedsRefresh = false;

        switch (ui)
        {
            case UI_WELCOME:           show_welcome();             break;
            case UI_DASH:              show_dash();                break;
            case UI_MENU:              show_menu();                break;
            case UI_COUNTDOWN:         show_countdown();           break;
            case UI_COUNTDOWN_EDIT_MIN:show_countdown_edit_min();  break;
            case UI_DEVSET_MENU:       show_devset_menu();         break;
            case UI_RESET_CONFIRM:     show_reset_confirm();       break;
            case UI_DEVSET_EDIT_DATE:  show_devset_edit_date();    break;
            case UI_DEVSET_EDIT_TIME:  show_devset_edit_time();    break;
            case UI_DEVSET_EDIT_DAY:   show_devset_edit_day();     break;
            /* Inline-toggle items don't navigate to a sub-screen,
               but leave these stubs for future navigation if needed */
            case UI_SETTINGS_GAP:      show_settings_gap();        break;
            case UI_SETTINGS_RETRY:    show_settings_retry();      break;
            case UI_SETTINGS_UV:       show_settings_uv();         break;
            case UI_SETTINGS_OV:       show_settings_ov();         break;
            case UI_SETTINGS_OL:       show_settings_ol();         break;
            case UI_SETTINGS_UL:       show_settings_ul();         break;
            case UI_SETTINGS_MAXRUN:   show_settings_maxrun();     break;
            case UI_SETTINGS_PWRREST:  show_settings_pwrrest();    break;
            case UI_SETTINGS_FACTORY:  show_settings_factory();    break;
            default: break;
        }
    }
}
